share/tutorials/incompressible/piso/les/motor_bike/motor_bike/0.org/include/fixedInlet
inlet
{
  type  fixedValue;
  value $internalField;
}
