share/tutorials/incompressible/piso/les/motor_bike/motor_bike/0.org/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            fixedValue;
    value           uniform 0;
  }
  lowerWall
  {
    type            zeroGradient;
  }
  "motorBike_.*"
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            symmetryPlane;
  }
  "(front|back)"
  {
    type            symmetryPlane;
  }
  "proc.*"
  {
    type            processor;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
