share/tutorials/incompressible/piso/les/motor_bike/motor_bike/system/blockMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 1;
vertices
(
  (-5 -4 0)
  (15 -4 0)
  (15  4 0)
  (-5  4 0)
  (-5 -4 8)
  (15 -4 8)
  (15  4 8)
  (-5  4 8)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (20 8 8) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  front
  {
    type symmetryPlane;
    faces
    (
      (3 7 6 2)
    );
  }
  back
  {
    type symmetryPlane;
    faces
    (
      (1 5 4 0)
    );
  }
  inlet
  {
    type patch;
    faces
    (
      (0 4 7 3)
    );
  }
  outlet
  {
    type patch;
    faces
    (
      (2 6 5 1)
    );
  }
  lowerWall
  {
    type wall;
    faces
    (
      (0 3 2 1)
    );
  }
  upperWall
  {
    type symmetryPlane;
    faces
    (
      (4 5 6 7)
    );
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
