share/tutorials/incompressible/piso/les/motor_bike/motor_bike/system/decomposeParDict.ptscotch
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      decomposeParDict;
}

numberOfSubdomains 4;
method          ptscotch;
simpleCoeffs
{
  n               (4 1 1);
  delta           0.001;
}
hierarchicalCoeffs
{
  n               (2 2 1);
  delta           0.001;
  order           xyz;
}
manualCoeffs
{
  dataFile        "cellDecomposition";
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
