share/tutorials/incompressible/piso/les/motor_bike/motor_bike/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         steadyState;
}
gradSchemes
{
  default         Gauss linear;
  grad(U)         cellLimited Gauss linear 1;
  grad(nuTilda)   cellLimited Gauss linear 1;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss linearUpwindV grad(U);
  div(phi,k)      bounded Gauss upwind;
  div(phi,omega)  bounded Gauss upwind;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
  div(phi,nuTilda) bounded Gauss upwind;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}
wallDist
{
  method meshWave;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
